#### PlasticvinylPatternType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "PlasticvinylPattern" from the "PlasticVinyl" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum PlasticvinylPatternType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PlasticvinylPatternType ``` |

| Visual C++ |
| --- |
| ``` public enum class PlasticvinylPatternType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Custom |  |

# See Also

Autodesk.Revit.DB.Visual Namespace